// package alias -- алиасы для приложения
package alias

// АБотНомер -- номер бота
type АБотНомер int

// АУрон -- урон от выстрела
type АУрон int

// АВремя -- строковый тип количества времени
type АВремя string

// АЧас -- количество часов
type АЧас uint

// АМин -- количество минут
type АМин uint

// АСек -- количество секунд
type АСек uint

// ААренаИмя -- имя арены
type ААренаИмя string

// ААренаСостояние -- состояние арены (не существует, апгрейд, ожидание, работа)
type ААренаСостояние string

// АРаботаИмя -- имя текущей работы арены (серебро-1, серебро-3, зависит от выбранного режима)
type АРаботаИмя string

// АРежим -- номер режима арены (1/2/...)
type АРежим int
